// Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.

// N = 5 -> "5, 4, 3, 2, 1"
// N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"
//Ввод
int n = ReadData("введите 1ое число: ");

//Вывод
PrintNaturalNumbers(n);

///=============================Методы========================================
//-М- метода генерации 2умерного случайного массива
int ReadData(string msg)
{
    Console.Write(msg);
    return int.Parse(Console.ReadLine() ?? "0");
}

//-М- метода рекррентного вызова элементов для натуральных чисел обратной последовательности
void PrintNaturalNumbers(int n)
{
    if (n <= 0)
    {return;}
    Console.Write(n);
    if (n > 1)
    {Console.Write(", ");}
    PrintNaturalNumbers(n - 1);
}